::************************************************
::HowToFor
::************************************************
::ループ用の変数は1文字(全角可)でなくてはならない
::コマンドラインでは%は1つでよい
::ループ変数の大文字小文字は区別される
::************************************************
@echo off
title %~n0%~x0
	
echo リストを順に実行していく用法

::for %%変数名 in (リスト) do (
::	コマンド
::	...
::)

for %%あ in (one, two, three) do echo %%あ
echo.
echo Next
pause > nul
cls
::************************************************
echo ループカウンタ的用法

::for /l %%変数名 in (初期値, 増分値, 終了値) do (
::	コマンド
::	...
::)

for /l %%i in (0, 1, 10) do (
	echo i=%%i
)

echo Next
pause > nul
cls
::************************************************
echo 二重ループ

for /l %%i in (0, 1, 5) do (

	for /l %%j in (5, -1, 0) do (

		echo i=%%i j=%%j

	)

)
echo Next
pause > nul
cls
::************************************************
