::********************************************************
:: TimeStamp_YYYYMMDD.bat
::********************************************************
:: Function  : 日付8桁タイムスタンプ取得
:: Parameter : なし
:: Return    : TSD(起動時の日付8桁格納)
::********************************************************
:TimeStampD

	setlocal

	::YYYY/MM/DD
	::0123456789

	set YYYY=%DATE:~0,-6%
	set MM=%DATE:~5,-3%
	set DD=%DATE:~-2%

	endlocal & set TSD=%YYYY%%MM%%DD%

exit /b
::********************************************************
